<?php

namespace App\Constants;

class AdminOperationLogConstant extends AppConstant
{
    const ADMIN_OPERATION_TYPE = [
        /*-------------合作方相关操作 [1,99]-------------*/
        // 合作方[1,9]
        '1' => [ 'code' => '1', 'remark' => '创建合作方'],
        '2' => [ 'code' => '2', 'remark' => '删除合作方'],
        '3' => [ 'code' => '3', 'remark' => '编辑合作方'],
        '4' => [ 'code' => '4', 'remark' => '重置合作方密码'],
        '5' => [ 'code' => '5', 'remark' => '冻结合作方帐号'],
        '6' => [ 'code' => '6', 'remark' => '解冻合作方帐号'],
        // 审查条件[50,59]
        '51' => [ 'code' => '51', 'remark' => '创建审查条件'],
        '52' => [ 'code' => '52', 'remark' => '删除审查条件'],
        '53' => [ 'code' => '53', 'remark' => '编辑审查条件'],

        /*-------------渠道相关操作 [100,199]-------------*/
        '101' => [ 'code' => '101', 'remark' => '创建渠道'],
        '102' => [ 'code' => '102', 'remark' => '删除渠道'],
        '103' => [ 'code' => '103', 'remark' => '编辑渠道'],

        /*-------------系统权限相关操作 [200,399]-------------*/
        // 权限[201,209]
        '201' => [ 'code' => '201', 'remark' => '创建权限'],
        '202' => [ 'code' => '202', 'remark' => '删除权限'],
        '203' => [ 'code' => '203', 'remark' => '编辑权限'],
        // 部门[210,219]
        '210' => [ 'code' => '210', 'remark' => '创建部门'],
        '211' => [ 'code' => '211', 'remark' => '删除部门'],
        '212' => [ 'code' => '212', 'remark' => '编辑部门'],
        // 角色[220,229]
        '220' => [ 'code' => '220', 'remark' => '创建角色'],
        '221' => [ 'code' => '221', 'remark' => '删除角色'],
        '222' => [ 'code' => '222', 'remark' => '编辑角色'],
        // 用户[230,239]
        '230' => [ 'code' => '230', 'remark' => '创建用户'],
        '231' => [ 'code' => '231', 'remark' => '删除用户'],
        '232' => [ 'code' => '232', 'remark' => '编辑用户'],

        /*-------------全局配置相关操作 [400,499]-------------*/
        '400' => [ 'code' => '400', 'remark' => '创建配置项'],
        '401' => [ 'code' => '401', 'remark' => '删除配置项'],
        '402' => [ 'code' => '402', 'remark' => '编辑配置项'],

        /*-------------通用操作 [500,599]-------------*/
        '500' => [ 'code' => '500', 'remark' => '修改登录密码'],
    ];
}
