<?php

namespace App\Helpers;

class RestUtils
{
    public static function getStdObj()
    {
        return new \stdClass();
    }

    /**
     * 获取错误代码的错误信息
     *
     * @param $code
     *
     * @return mixed|string
     */
    public static function getErrorMessage($code)
    {
        $codeMsg = [
            '1' => '出错啦,请重试',
            '1000' => 'url请求参数不正确',
            '1001' => '错误的token值',
            '1002' => '参数错误或未产生返回值',
            '1003' => '不存在的类名',
            '1004' => '数据添加错误',
            '1005' => '暂无数据',
            '1006' => '方法调用错误',
            '1007' => 'data 格式错误',
            '1500' => '暂无数据',
            '2000' => '错误',
            '2101' => '创建失败',
            '2102' => '更新失败',
            //用户管理
            '1101' => '用户名或密码错误',
            '1102' => '用户名或密码错误',
            '1103' => 'accessToken错误',
            '1104' => '用户已注册',
            '1105' => '用户注册成功',
            '1106' => '用户名不存在',
            '1108' => '密码修改成功',
            '1109' => '密码修改失败',
            '1110' => '等待退出',
            '1111' => '错误',
            '1112' => '请输入正确的手机号',
            '1113' => '请选择身份',
            '1114' => '绑定手机号失败',
            '1115' => '手机号已注册',
            '1116' => '用户错误',
            '1117' => '不能为空',
            '1118' => '不可重复提交',
            '1119' => '密码不能为空',
            '1120' => '抱歉，昵称已被占用...',
            '1121' => '修改手机号成功',
            '1122' => '修改手机号失败',

            //验证码相关
            '1200' => '短信验证码发送成功',
            '1201' => '在1分钟内不能重复获取验证码',
            '1202' => '请输入手机号码',
            '1203' => '短信验证码失效',
            '1204' => '短信验证码错误,请重新输入',
            '1205' => '短信验证码发送失败',
            //资讯相关
            '1301' => 'sign不存在',
            '1302' => '用户不存在',
            //收藏相关
            '1401' => '请重新收藏',
            //精准匹配相关
            '1501' => '用户匹配错误',
            '1502' => '跳转至信息填写的引导页',
            //评论
            '1600' => '添加评论失败',
            '1601' => '暂无评论数据',
            '1602' => '添加回复失败',
            '1603' => '回复不能为空',
            '1604' => '已点击过，不可重复点击',
            '1605' => '错误',
            '1607' => '含有敏感词汇，请重新填写',
            //反馈
            '1700' => '数据不能为空',
            //产品相关
            '1800' => '暂时没有数据',
            //服务器
            '500' => '服务器',
            //免密码登录相关
            '1900' => '不存在该平台',
            '1901' => '点击借款修改失败',
            '1902' => '非法操作',
            //积分+邀请
            '2100' => '无效的邀请',
            //极光推送
            '2200' => 'RegistrationId is not exist',
            '2201' => 'Jpush failed',
            '2202' => 'No push message',
            //版本信息
            '3000' => '参数不合法',
            '3001' => '版本信息获取成功',
            '3002' => '版本升级信息获取失败',
            '3003' => '亲，您当前没有要更新的版本！',
            //编码转义
            '4000' => '无效的编码转义',
            //计算器
            '5000' => '获取数据失败，请重新加载',
            //积分兑现金
            '6000' => '积分兑现金出错啦',
            '6001' => '积分不足',
            '6002' => '对不起,积分兑换流水插入数据失败！',
            '6003' => '对不起,用户总积分减少失败！',
            '6004' => '对不起,用户账户流水插入数据失败！',
            '6005' => '对不起,账户增加现金失败！',

            //提现
            '7000' => '提现出错啦',
            '7001' => '余额不足',
            '7002' => '用户账户流水表插入数据失败',
            '7003' => '用户提现流水表插入数据失败！',
            '7004' => '对不起,账户增加现金失败！',

            //产品申请加积分
            '8000' => '积分产品申请出错啦！',
            '8001' => '产品配置表判断失败!',
            '8002' => '产品已经申请,不再加积分!',
            '8003' => '积分产品申请流水表插入数据失败!',
            '8004' => '积分流水表加积分失败!',
            '8005' => '用户积分表加积分失败!',
            '8006' => '否被邀请过判断失败!',
            '8007' => '邀请人账户流水表插入数据失败!',
            '8008' => '邀请人账户表更新数据失败!',

        ];

        return isset($codeMsg[$code]) ? $codeMsg[$code] : '';
    }
}
